DataProcessors/ЗагрузкаПрайсЛиста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаПрайсЛиста</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Documents/УстановкаЦенПоставщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>УстановкаЦенПоставщика</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныНоменклатурыПоставщиков</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ЗагрузкаПрайсЛиста/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗагрузитьПрайсЛист(Команда)
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОповещениеОЗавершении", ЭтотОбъект);
	Если Не ЗначениеЗаполнено(ЭтаФорма.ДатаПрайсЛиста) ИЛИ Не ЗначениеЗаполнено(ЭтаФорма.Поставщик) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Заполните необходимые реквизиты!";
		Сообщение.Сообщить();
	Иначе
		НачатьПомещениеФайлаНаСервер(ОповещениеОЗавершении,,,,,УникальныйИдентификатор);
	КонецЕсли;
	КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОЗавершении(ОписаниеПомещенногоФайла,ДополнительныеПараметры) Экспорт 
	Если ОписаниеПомещенногоФайла <> Неопределено Тогда
		АдресФайла = ОписаниеПомещенногоФайла.Адрес;
		ЗагрузитьИзТабличногоДокументаНаСервере(АдресФайла,ДатаПрайсЛиста,Поставщик);
	КонецЕсли;
КонецПроцедуры 

&НаСервереБезКонтекста
Процедура ЗагрузитьИзТабличногоДокументаНаСервере(АдресФайла,ДатаПрайсЛиста,Поставщик)
	ТабДок = ПрочитатьФайл(АдресФайла); 
	ТаблицаПрайсЛиста = ЗаполнитьТаблицуЗначений(ТабДок); 
	Если ТаблицаПрайсЛиста.Количество() Тогда
		ЗагрузкаПрайсЛиста(ТаблицаПрайсЛиста,ДатаПрайсЛиста,Поставщик);
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Выбранный файл не содержит строк с ценами!";
		Сообщение.Сообщить(); 
	КонецЕсли;
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПрочитатьФайл(АдресФайла)
	ТабДок = Новый ТабличныйДокумент;
	ИмяВременногоФайла = ПолучитьИмявременногоФайла("xlsx");
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайла);
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	
	Попытка 		
		ТабДок.Прочитать(ИмяВременногоФайла);
	Исключение
		вызватьИсключение "Не удалось прочитать файл EXCEL в табличный документ!";
	КонецПопытки;
	Возврат ТабДок;
КонецФункции 

&НаСервереБезКонтекста
Функция ЗаполнитьТаблицуЗначений(ТабДок)
	ОбластиТабличногоДокумента = ТабДок.Область(1,1,ТабДок.ВысотаТаблицы,ТабДок.ШиринаТаблицы);
	Построитель = Новый ПостроительЗапроса;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластиТабличногоДокумента);
	Построитель.Выполнить();
	
	ТаблицаПрайсЛиста = Построитель.Результат.Выгрузить();
	Возврат ТаблицаПрайсЛиста;	
КонецФункции  

&НаСервереБезКонтекста
Процедура ЗагрузкаПрайсЛиста(ТаблицаПрайсЛиста,ДатаПрайсЛиста,Поставщик) 
	Запрос = Новый запрос;
	запрос.Текст = "ВЫБРАТЬ
	|	ТаблицаПрайсЛиста.Артикул КАК Артикул,
	|	ТаблицаПрайсЛиста.Цена КАК Цена
	|ПОМЕСТИТЬ ВТ_ТаблицаПрайсЛиста
	|ИЗ
	|	&ТаблицаПрайсЛиста КАК ТаблицаПрайсЛиста
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	ВТ_ТаблицаПрайсЛиста.Цена КАК Цена
	|ИЗ
	|	ВТ_ТаблицаПрайсЛиста КАК ВТ_ТаблицаПрайсЛиста
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО ВТ_ТаблицаПрайсЛиста.Артикул = Номенклатура.Артикул";
	Запрос.УстановитьПараметр("ТаблицаПрайсЛиста",ТаблицаПрайсЛиста);  
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	ДокументУстановкаЦен = Документы.УстановкаЦенПоставщика.СоздатьДокумент();
	ДокументУстановкаЦен.Дата = ДатаПрайсЛиста;
	ДокументУстановкаЦен.Контрагент = Поставщик; 
	ДокументУстановкаЦен.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ДокументУстановкаЦен.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
	КонецЦикла;
	
	Попытка
		
		ДокументУстановкаЦен.Записать(РежимЗаписиДокумента.Проведение);
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Создан и проведен документ %1", ДокументУстановкаЦен.Ссылка);
		Сообщение.Сообщить();
		
	Исключение
		ДокументУстановкаЦен.Записать(); 	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Произошла ошибка при проведении документа установки цен!";
		Сообщение.Сообщить();
	КонецПопытки;  	
	
КонецПроцедуры
